# Pandas Tutorial 
### Pandas is a Python library commonly used for analyzing, filtering and manipulating data, especially tabular ("table like") data

In [0]:
import pandas as pd
from google.colab import files
import numpy as np
import matplotlib.pyplot as plt

### Dataset for tutorial and problem set:

    Pima Indian Heritage Diabetes

    Each person in the dataset is a female who is at least 21 years old
    
  #### Below are the variables for each person in the dataset
      'preg': number of pregnancies  
      'plas': plasma glucose concentration 
      'pres': blood pressure 
      'skin': skin thickness
      'test': Insulin
      'mass': BMI
      'pedi': diabetes pedigree function
      'age': age
      'class': '0' means does not have diabetes and '1' means has diabetes

Go to the link below to see the raw comma seperated values (csv) data:

https://raw.githubusercontent.com/jbrownlee/Datasets/master/pima-indians-diabetes.data.csv

#### Read csv with pandas

In [0]:
url = "https://raw.githubusercontent.com/jbrownlee/Datasets/master/pima-indians-diabetes.data.csv"
names = ['preg', 'plas', 'pres', 'skin', 'test', 'mass', 'pedi', 'age', 'class']
data = pd.read_csv(url, names=names)

In [3]:
type(data)  # dataframe is Pandas primary data structure|

pandas.core.frame.DataFrame

In [4]:
data.head(4)  # get a peek of the dataframe, each row is one person

   preg  plas  pres  skin  test  mass   pedi  age  class
0     6   148    72    35     0  33.6  0.627   50      1
1     1    85    66    29     0  26.6  0.351   31      0
2     8   183    64     0     0  23.3  0.672   32      1
3     1    89    66    23    94  28.1  0.167   21      0

In [5]:
data.shape   # tuple of the dimensionality, just like numpy

(768, 9)

In [6]:
"There are " + str(data.shape[0]) + " people in the study with " + str(data.shape[1]) + " variables each "

'There are 768 people in the study with 9 variables each '

In [7]:
data.count()  # there are several functions with dataframes, you can explore the documentation and use tab complete to see other functions and variables associated with dataframes

preg     768
plas     768
pres     768
skin     768
test     768
mass     768
pedi     768
age      768
class    768
dtype: int64

In [8]:
data.describe()  # a dataframe function which provides the basic seen statistics below

             preg        plas        pres  ...        pedi         age       class
count  768.000000  768.000000  768.000000  ...  768.000000  768.000000  768.000000
mean     3.845052  120.894531   69.105469  ...    0.471876   33.240885    0.348958
std      3.369578   31.972618   19.355807  ...    0.331329   11.760232    0.476951
min      0.000000    0.000000    0.000000  ...    0.078000   21.000000    0.000000
25%      1.000000   99.000000   62.000000  ...    0.243750   24.000000    0.000000
50%      3.000000  117.000000   72.000000  ...    0.372500   29.000000    0.000000
75%      6.000000  140.250000   80.000000  ...    0.626250   41.000000    1.000000
max     17.000000  199.000000  122.000000  ...    2.420000   81.000000    1.000000

[8 rows x 9 columns]

#### Slicing

 iloc: indexing with integers similar to numpy 
 basic format: i:j:k where i is the starting index, j is the stopping index, and k is the step size

In [9]:
data.iloc[0:3]  # equivalent to data.iloc[0:3:1]

   preg  plas  pres  skin  test  mass   pedi  age  class
0     6   148    72    35     0  33.6  0.627   50      1
1     1    85    66    29     0  26.6  0.351   31      0
2     8   183    64     0     0  23.3  0.672   32      1

In [10]:
# can index columns as well
data.iloc[0:3, 7:]  # equivalent to data.iloc[0:3:1, 7:9:1]

   age  class
0   50      1
1   31      0
2   32      1

 loc: indexing mainly with labels  
same basic i:j:k format but with labels

In [11]:
data.loc[0:2, 'pres':'class']  # don't be fooled by the 0:2 this is because the labels are integers and not because it is indexing like .iloc

   pres  skin  test  mass   pedi  age  class
0    72    35     0  33.6  0.627   50      1
1    66    29     0  26.6  0.351   31      0
2    64     0     0  23.3  0.672   32      1

#### Chained Indexing/Masking

We can use selective indexing in order to slice out only data that we want to use. In this example, we're going to subset into this dataset to get only women over 39 who have had more than 2 pregnancies.

In [0]:
data_age_boolean = data.age > 39  # creates a Pandas series which has a True or False vlaue for each row in the dataframe depending on the column's age

In [13]:
data['age'].head(3)  # only first value is greater than 39

0    50
1    31
2    32
Name: age, dtype: int64

In [14]:
data_age_boolean.head(3)  # only first value is greater than 39

0     True
1    False
2    False
Name: age, dtype: bool

In [15]:
data_age_boolean.count()  # same size as data dataframe

768

In [0]:
filtered_dataframe_by_age = data[data['age'] > 39]

In [17]:
str(len(filtered_dataframe_by_age)) + " people are older than 39 in this study"

'207 people are older than 39 in this study'

In [18]:
data[(data['age'] > 39) & (data['preg'] > 2)].head(3)  # use '|' instead of & for an or operation

    preg  plas  pres  skin  test  mass   pedi  age  class
0      6   148    72    35     0  33.6  0.627   50      1
9      8   125    96     0     0   0.0  0.232   54      1
12    10   139    80     0     0  27.1  1.441   57      0

In [19]:
str(len(data[(data['age']> 39) & (data['preg'] > 2)])) + " people are older than 39 and have had more than 2 pregnancies in this study"

'172 people are older than 39 and have had more than 2 pregnancies in this study'

#### Accounting for missing values

Datasets will frequently have some data missing, so you should know how to accomodate for missing values. NaN in pandas stands for not a number and indicates missing entries in a dataframe. There are a few simple ways to handle missing values in Pandas: 


*   Delete rows with missing values
*   Fill missing values with appropriate or neutral value

The appropriate way of handling missing values depends on the context, so it is important to have all the methods listed above available in your coding arsenal

In [20]:
example_data = pd.DataFrame( {'col1': [1, None, 2], 'col2': [3, 4, np.nan]})  # pandas automatically converts None to NaN
example_data

   col1  col2
0   1.0   3.0
1   NaN   4.0
2   2.0   NaN

In [21]:
example_data['col1'].mean()  # handles as you would expect and ignores missing value

1.5

In [22]:
example_data['col1'].max() # handles as you would expect and ignores missing value

2.0

In [27]:
example_data.dropna() # This function removes all rows containing NA. This is the simplest method, but causes us to lose data.

   col1  col2
0   1.0   3.0

In [29]:
example_data.fillna(-1)  # This function fills NA boxes with a given parameter.

   col1  col2
0   1.0   3.0
1  -1.0   4.0
2   2.0  -1.0